Revit 2027 API
FabricSheetType.CreateDefaultFabricSheetType Method
 Creates a new FabricSheetType object with a default name.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId CreateDefaultFabricSheetType(
	Document ADoc
)
Public Shared Function CreateDefaultFabricSheetType (
	ADoc As Document
) As ElementId
public:
static ElementId^ CreateDefaultFabricSheetType(
	Document^ ADoc
)
static member CreateDefaultFabricSheetType :
        ADoc : Document -> ElementId
Parameters
ADoc Document
 The document.
Return Value
ElementId
 The newly created type id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace